OpenNuvoton/M2354BSP/SampleCode/StdDriver/SDH_FATFS/main.c
/******************************************************************************
 * @file     main.c
 * @version  V1.00
 * @brief    Access a SD card formatted in FAT file system
 *
 * @copyright SPDX-License-Identifier: Apache-2.0
 * @copyright Copyright (C) 2020 Nuvoton Technology Corp. All rights reserved.
*****************************************************************************/
#include <stdio.h>
#include <string.h>

#include "NuMicro.h"
#include "diskio.h"
#include "ff.h"

#define BUFF_SIZE       (8*1024)

static uint32_t u32Blen = BUFF_SIZE;
static DWORD s_u32AccSize;                         /* Work register for fs command */
static WORD s_u16AccFiles, s_u16AccDirs;
static FILINFO Finfo;

static char s_achLine[256];                         /* Console input buffer */

#ifdef __ICCARM__
#pragma data_alignment=4
uint8_t s_au8BuffPool[BUFF_SIZE] ;       /* Working buffer */
#else
static __attribute__((aligned)) uint8_t s_au8BuffPool[BUFF_SIZE] ;       /* Working buffer */
#endif
static uint8_t  *s_pu8Buff;
static uint32_t volatile s_u32Sec = 0;


void TMR0_IRQHandler(void);
void SDH0_IRQHandler(void);
void timer_init(void);
uint32_t get_timer_value(void);
void  dump_buff_hex(uint8_t *pucBuff, int8_t i8Bytes);
int xatoi(          /* 0:Failed, 1:Successful */
    TCHAR **str,    /* Pointer to pointer to the string */
    unsigned long *pi32Res       /* Pointer to a variable to store the value */
);
void put_dump(
    const uint8_t* pu8Buff,  /* Pointer to the byte array to be dumped */
    uint32_t u32Addr,         /* Heading address value */
    int32_t i32Cnt                     /* Number of bytes to be dumped */
);
void get_line(char *buff, int32_t i32Len);
void put_rc(FRESULT rc);
void SYS_Init(void);


void TMR0_IRQHandler(void)
{
    s_u32Sec++;

    /* clear timer interrupt flag */
    TIMER_ClearIntFlag(TIMER0);

}

void timer_init(void)
{
    /* Set timer frequency to 1HZ */
    TIMER_Open(TIMER0, TIMER_PERIODIC_MODE, 1000);

    /* Enable timer interrupt */
    TIMER_EnableInt(TIMER0);
    NVIC_EnableIRQ(TMR0_IRQn);


    /* Start Timer 0 */
    TIMER_Start(TIMER0);
}

uint32_t get_timer_value(void)
{
    return s_u32Sec;
}

void  dump_buff_hex(uint8_t *pucBuff, int8_t i8Bytes)
{
    int8_t     i8Idx, i;

    i8Idx = 0;
    while(i8Bytes > 0)
    {
        printf("0x%04X  ", i8Idx);
        for(i = 0; i < 16; i++)
            printf("%02x ", pucBuff[i8Idx + i]);
        printf("  ");
        for(i = 0; i < 16; i++)
        {
            if((pucBuff[i8Idx + i] >= 0x20) && (pucBuff[i8Idx + i] < 127))
                printf("%c", pucBuff[i8Idx + i]);
            else
                printf(".");
            i8Bytes--;
        }
        i8Idx += 16;
        printf("\n");
    }
    printf("\n");
}


/*--------------------------------------------------------------------------*/
/* Monitor                                                                  */

/*----------------------------------------------*/
/* Get a value of the string                    */
/*----------------------------------------------*/
/*  "123 -5   0x3ff 0b1111 0377  w "
        ^                           1st call returns 123 and next ptr
           ^                        2nd call returns -5 and next ptr
                   ^                3rd call returns 1023 and next ptr
                          ^         4th call returns 15 and next ptr
                               ^    5th call returns 255 and next ptr
                                  ^ 6th call fails and returns 0
*/

int xatoi(          /* 0:Failed, 1:Successful */
    TCHAR **str,    /* Pointer to pointer to the string */
    unsigned long *pi32Res       /* Pointer to a variable to store the value */
)
{
    uint32_t u32Val;
    uint8_t u8R, u8S = 0;
    TCHAR c;

    *pi32Res = 0;
    while((c = **str) == ' ')(*str)++;      /* Skip leading spaces */

    if(c == '-')        /* negative? */
    {
        u8S = 1;
        c = *(++(*str));
    }

    if(c == '0')
    {
        c = *(++(*str));
        switch(c)
        {
            case 'x':       /* hexadecimal */
                u8R = 16;
                c = *(++(*str));
                break;
            case 'b':       /* binary */
                u8R = 2;
                c = *(++(*str));
                break;
            default:
                if(c <= ' ') return 1;  /* single zero */
                if(c < '0' || c > '9') return 0;    /* invalid char */
                u8R = 8;      /* octal */
        }
    }
    else
    {
        if(c < '0' || c > '9') return 0;    /* EOL or invalid char */
        u8R = 10;         /* decimal */
    }

    u32Val = 0;
    while(c > ' ')
    {
        if(c >= 'a') c -= 0x20;
        c -= '0';
        if(c >= 17)
        {
            c -= 7;
            if(c <= 9) return 0;    /* invalid char */
        }
        if(c >= u8R) return 0;        /* invalid char for current radix */
        u32Val = u32Val * u8R + c;
        c = *(++(*str));
    }
    if(u8S) u32Val = 0 - u32Val;            /* apply sign if needed */

    *pi32Res = u32Val;
    return 1;
}


/*----------------------------------------------*/
/* Dump a block of byte array                   */

void put_dump(
    const uint8_t* pu8Buff,  /* Pointer to the byte array to be dumped */
    uint32_t u32Addr,         /* Heading address value */
    int32_t i32Cnt                     /* Number of bytes to be dumped */
)
{
    int i;

    printf("%08x ", u32Addr);

    for(i = 0; i < i32Cnt; i++)
        printf(" %02x", pu8Buff[i]);

    printf(" ");
    for(i = 0; i < i32Cnt; i++)
        putchar((TCHAR)((pu8Buff[i] >= ' ' && pu8Buff[i] <= '~') ? pu8Buff[i] : '.'));

    printf("\n");
}


/*--------------------------------------------------------------------------*/
/* Monitor                                                                  */
/*--------------------------------------------------------------------------*/

static
FRESULT scan_files(
    char* path      /* Pointer to the path name working buffer */
)
{
    DIR dirs;
    FRESULT res;
    uint32_t i;
    char *fn;


    if((res = f_opendir(&dirs, path)) == FR_OK)
    {
        i = strlen(path);
        while(((res = f_readdir(&dirs, &Finfo)) == FR_OK) && Finfo.fname[0])
        {
            if(_FS_RPATH && Finfo.fname[0] == '.') continue;

            fn = Finfo.fname;

            if(Finfo.fattrib & AM_DIR)
            {
                s_u16AccDirs++;
                *(path + i) = '/';
                strcpy(path + i + 1, fn);
                res = scan_files(path);
                *(path + i) = '\0';
                if(res != FR_OK) break;
            }
            else
            {
                /*              printf("%s/%s\n", path, fn); */
                s_u16AccFiles++;
                s_u32AccSize += Finfo.fsize;
            }
        }
    }

    return res;
}

void put_rc(FRESULT rc)
{
    const TCHAR *p =
        _T("OK\0DISK_ERR\0INT_ERR\0NOT_READY\0NO_FILE\0NO_PATH\0INVALID_NAME\0")
        _T("DENIED\0EXIST\0INVALID_OBJECT\0WRITE_PROTECTED\0INVALID_DRIVE\0")
        _T("NOT_ENABLED\0NO_FILE_SYSTEM\0MKFS_ABORTED\0TIMEOUT\0LOCKED\0")
        _T("NOT_ENOUGH_CORE\0TOO_MANY_OPEN_FILES\0");

    uint32_t i;
    for(i = 0; (i != (UINT)rc) && *p; i++)
    {
        while(*p++) ;
    }
    printf(_T("rc=%u FR_%s\n"), (UINT)rc, p);
}

/*----------------------------------------------*/
/* Get a line from the input                    */
/*----------------------------------------------*/

void get_line(char *buff, int32_t i32Len)
{
    TCHAR c;
    int32_t i32Idx = 0;

    for(;;)
    {
        c = (TCHAR)getchar();
        putchar(c);
        if(c == '\r') break;
        if((c == '\b') && i32Idx) i32Idx--;
        if((c >= ' ') && (i32Idx < i32Len - 1)) buff[i32Idx++] = c;
    }
    buff[i32Idx] = 0;

